In [1]:
import pandas as pd

# Working with json

In [2]:
df=pd.read_json("https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/main/day16%20-%20working-with-json-and-sql/train.json")

In [3]:
df.head()

      id      cuisine                                        ingredients
0  10259        greek  [romaine lettuce, black olives, grape tomatoes...
1  25693  southern_us  [plain flour, ground pepper, salt, tomatoes, g...
2  20130     filipino  [eggs, pepper, salt, mayonaise, cooking oil, g...
3  22213       indian                [water, vegetable oil, wheat, salt]
4  13162       indian  [black pepper, shallots, cornflour, cayenne pe...

# Working with sql

In [4]:
import mysql.connector as cnn

In [5]:
conn=cnn.connect(host="localhost",user="root",password="",database="world")

In [6]:
pd.read_sql_query("select * from city where district like 'delhi'",conn)

     ID              Name CountryCode District  Population
0  1025             Delhi         IND    Delhi     7206704
1  1109         New Delhi         IND    Delhi      301297
2  1351  Delhi Cantonment         IND    Delhi       94326

In [18]:
con2=cnn.connect(host="localhost",user="root",password="",database="mydb")
mycursor=con2.cursor()

In [20]:
mycursor.execute("select * from student")
mycursor.fetchall()

[]

In [21]:
pd.read_sql_query("select * from passenger",con2)

   id  name email
0   1  dfdf  dhfh
1   2   sef  dhft